### 2.2 데이터 프레임(DataFrame)

In [2]:
import numpy as np
import pandas as pd

- 생성 방법1
    - 2차원 데이터,컬럼,인덱스

In [3]:
df1 = pd.DataFrame(
    np.random.randint(40, 101, 12).reshape(4, 3),       # 2차원 데이터
    columns=list('XYZ'),            # 컬럼명, list('XYZ') ==> ['X','Y','Z']
    index=list('abcd')              # 인덱스
)
df1

    X   Y   Z
a  51  42  79
b  75  81  93
c  99  63  47
d  77  43  74

- 생성 방법2
    - 딕셔너리의 리스트

In [4]:
data = [
    {'X':87,'Y':56,'Z':47},
    {'X':43,'Y':97,'Z':84},
    {'X':53,'Y':79,'Z':71},
    {'X':42,'Y':78,'Z':84}
]
df2 = pd.DataFrame(data, index=list('abcd'))
df2

    X   Y   Z
a  87  56  47
b  43  97  84
c  53  79  71
d  42  78  84

- 생성방법 3
    - 데이터가 value, 컬럼명이 key가 되는 딕셔너리

In [5]:
data = {
    'X': [87, 43, 53, 42],
    'Y': [56, 97, 79, 78],
    'Z': [47, 84, 73, 84]
}
df3 = pd.DataFrame(data, index=list('abcd'))
df3

    X   Y   Z
a  87  56  47
b  43  97  84
c  53  79  73
d  42  78  84

- 여러가지 타입이 혼합된 형태의 데이터로 생성

In [6]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index=index, columns=columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [7]:
df.index.name = '도시'
df.columns.name = '항목'
df

항목   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [8]:
df.values

array([['수도권', 9904312, 9631482, 9762546, 9853972, 0.0283],
       ['경상권', 3448737, 3393191, 3512547, 3655437, 0.0163],
       ['수도권', 2890451, 2632035, 2517680, 2466338, 0.0982],
       ['경상권', 2466052, 2431774, 2456016, 2473990, 0.0141]], dtype=object)

In [9]:
df.columns

Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object', name='항목')

In [10]:
df.index

Index(['서울', '부산', '인천', '대구'], dtype='object', name='도시')

In [11]:
data2 = [
    {'가게이름':'밥', '주문수':4000, '평점':5.0, '오픈상태':'on', '나와의거리(M)':435},
    {'가게이름':'면', '주문수':3050, '평점':4.9, '오픈상태':'on', '나와의거리(M)':2000},
    {'가게이름':'고기', '주문수':3000, '평점':4.5, '오픈상태':'off', '나와의거리(M)':452},
    {'가게이름':'몰라', '주문수':450, '평점':3.8, '오픈상태':'off', '나와의거리(M)':3242},
    {'가게이름':'몰?루', '주문수':55, '평점':2.0, '오픈상태':'미정', '나와의거리(M)':4827}
]
bamin = pd.DataFrame(data2, index=list('12345'))

In [12]:
bamin.index.name = '랭킹'
bamin.columns.name = '항목'
bamin

항목 가게이름   주문수   평점 오픈상태  나와의거리(M)
랭킹
1     밥  4000  5.0   on       435
2     면  3050  4.9   on      2000
3    고기  3000  4.5  off       452
4    몰라   450  3.8  off      3242
5   몰?루    55  2.0   미정      4827

- 연습문제 4.1.2

In [13]:
data = []
for i in range(5):
    d = {
        '문자열': chr(np.random.randint(65, 91)) + chr(np.random.randint(65, 91)),
        '정수1': np.random.randint(1, 7),
        '정수2': np.random.randint(40, 101),
        '정수3': np.random.randint(1, 100) * 1000,
        '실수': round(np.random.random(), 4)
    }
    data.append(d)
df4 = pd.DataFrame(data, index=list('vwxyz')) 
df4

  문자열  정수1  정수2    정수3      실수
v  HP    1   88  24000  0.5473
w  QT    1   97  57000  0.9581
x  LJ    3   91  22000  0.9034
y  BQ    3   99  64000  0.1558
z  NX    2   54  29000  0.7649

- 전치(Transpose)

In [14]:
df4.T

          v       w       x       y       z
문자열      HP      QT      LJ      BQ      NX
정수1       1       1       3       3       2
정수2      88      97      91      99      54
정수3   24000   57000   22000   64000   29000
실수   0.5473  0.9581  0.9034  0.1558  0.7649

- 열 데이터의 갱신, 추가

In [15]:
df

항목   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [16]:
df['2010-2015 증가율'] = df['2010-2015 증가율'] * 100
df

항목   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83
부산  경상권  3448737  3393191  3512547  3655437           1.63
인천  수도권  2890451  2632035  2517680  2466338           9.82
대구  경상권  2466052  2431774  2456016  2473990           1.41

In [17]:
# 열 이름이 있으면 갱신, 없으면 추가
df['Eng name'] = ['Seoul','Busan','Incheon','Dargu']
df

항목   지역     2015     2010     2005     2000  2010-2015 증가율 Eng name
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83    Seoul
부산  경상권  3448737  3393191  3512547  3655437           1.63    Busan
인천  수도권  2890451  2632035  2517680  2466338           9.82  Incheon
대구  경상권  2466052  2431774  2456016  2473990           1.41    Dargu

- 열 삭제

In [18]:
del df['2000']

In [19]:
df.drop(columns=['2005','2010'], inplace=True)
df

항목   지역     2015  2010-2015 증가율 Eng name
도시
서울  수도권  9904312           2.83    Seoul
부산  경상권  3448737           1.63    Busan
인천  수도권  2890451           9.82  Incheon
대구  경상권  2466052           1.41    Dargu

In [20]:
# 행을 지울 때
df.drop(['대구'], inplace=True)
df

항목   지역     2015  2010-2015 증가율 Eng name
도시
서울  수도권  9904312           2.83    Seoul
부산  경상권  3448737           1.63    Busan
인천  수도권  2890451           9.82  Incheon

- 열 인덱싱

In [21]:
# 열 이름을 하나만 선택하면 시리즈 반환
df['지역']

도시
서울    수도권
부산    경상권
인천    수도권
Name: 지역, dtype: object

In [22]:
# 열 이름이 리스트로 감싸져 있으면 데이터프레임 반환
df[['지역','Eng name']]

항목   지역 Eng name
도시
서울  수도권    Seoul
부산  경상권    Busan
인천  수도권  Incheon

- 개별 인덱싱

In [23]:
# 데이터프레임[열 이름][행 인덱스]
df['지역']['서울'], df['지역'].서울, df.지역['서울'], df.지역.서울

('수도권', '수도권', '수도권', '수도권')

In [24]:
# 컬럼명이 숫자로 시작하거나 공백이 있는 경우에는 . 컬럼명을 사용할 수 없다
df.2015['서울']

SyntaxError: invalid syntax (3024705217.py, line 2)

- 연습 문제 4.1.3
    - 다음 데이터프레임에서 지정하는 데이터를 뽑아내거나 처리하라.

In [33]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [34]:
# (1) 모든 학생의 수학 점수를 시리즈로 나타낸다.
df["수학"]

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [35]:
# (2) 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.
df[["국어", "영어"]]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [36]:
# (3) 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.
df['평균'] = (df.sum(axis=1) / len(df.columns)).round(1)
df

    국어  영어  수학    평균
춘향  80  90  90  86.7
몽룡  90  70  60  73.3
향단  70  60  80  70.0
방자  30  40  70  46.7

In [37]:
# (4) 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.
import warnings
warnings.filterwarnings('ignore')
del df["평균"]
df["영어"]["방자"] = 80
df['평균'] = (df.sum(axis=1) / len(df.columns)).round(1)
df

    국어  영어  수학    평균
춘향  80  90  90  86.7
몽룡  90  70  60  73.3
향단  70  60  80  70.0
방자  30  80  70  60.0

In [38]:
# (5) 춘향의 점수를 데이터프레임으로 나타낸다.
df.loc[["춘향"]]

    국어  영어  수학    평균
춘향  80  90  90  86.7

In [43]:
df.T[['춘향']].T

      국어    영어    수학    평균
춘향  80.0  90.0  90.0  86.7

In [44]:
df[:1]

    국어  영어  수학    평균
춘향  80  90  90  86.7

In [45]:
df['춘향':'춘향']

    국어  영어  수학    평균
춘향  80  90  90  86.7

In [41]:
# (6) 향단의 점수를 시리즈로 나타낸다.
df.loc["향단"]

국어    70.0
영어    60.0
수학    80.0
평균    70.0
Name: 향단, dtype: float64

In [40]:
df.T["향단"]

국어    70.0
영어    60.0
수학    80.0
평균    70.0
Name: 향단, dtype: float64